In [4]:
import numpy as np
import pandas as pd

In [5]:
df=pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,555,666,444],
                 'col3':['abc','def','ghi','xyz']})

In [6]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
df['col2'].unique()

array([444, 555, 666])

In [8]:
len(df['col2'].unique())

3

In [9]:
df['col2'].nunique()

3

In [10]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [11]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [12]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [13]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [14]:
def times2(x):
    return x*2

In [15]:
times2(df)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [16]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [23]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [27]:
df[['col1','col2']].apply(lambda x:x*2)

   col1  col2
0     2   888
1     4  1110
2     6  1332
3     8   888

In [28]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [29]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [30]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [31]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [32]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [33]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [34]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [35]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [37]:
df.notnull()

   col1  col2  col3
0  True  True  True
1  True  True  True
2  True  True  True
3  True  True  True

In [ ]:
data={'A':['foo','foo','foo']}